In [ ]:
'''
Filters
    - By Multiple Column Selection
    - using eq Function
    - Equal
    - Not Equal
    - And 
    - or
    - Between 
    - Negation :Tilde(~)
    - notnull
    - isin
    - Filter and look only for Specific Column
    - Condition and Multiple Condition
    - String Contains Function
    - row and column Labels and indices (.loc and .iloc)

In [ ]:
'''
1. Logical operators
    ex: df[df.val > 0.5]
2. Multiple logical operators
    ex: df[(df.val > 0.5) & (df.val2 == 1)]
3. Isin
    ex: df[df.name.isin(['Santhosh','Anand'])]
4. Regular Expression
5. Tilde (~)
6. Between
7. Where
4. Str accessor
    - contains,startswith
9. Nlargest or nsmallest
10. Multiple Conditions
8. Query
    - df.query('ctg == "B" and val > 0.5')
10. Loc and iloc
11. Lambda Methods
12. List Comprehensions

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("Titanic_train.csv")

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
# Column selection on DataFrame

df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [5]:
# df.filter(like='bbi', axis=0)

In [6]:
# Top 3 Largest Values in fare Column
df.nlargest(3, 'Fare')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C

In [7]:
# Top 3 smallest Values in fare Column
df.nsmallest(3, 'Fare')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
179,180,0,3,"Leonard, Mr. Lionel",male,36.0,0,0,LINE,0.0,NaN,S
263,264,0,1,"Harrison, Mr. William",male,40.0,0,0,112059,0.0,B94,S
271,272,1,3,"Tornquist, Mr. William Henry",male,25.0,0,0,LINE,0.0,NaN,S

In [10]:
# Apply Filter Function 

# Filter DataFrme Selecting only Columns 'Pclass' 'Name' and 'Sex'
df.filter(['Pclass','Name','Sex']).head()

   Pclass                                               Name     Sex
0       3                            Braund, Mr. Owen Harris    male
1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2       3                             Heikkinen, Miss. Laina  female
3       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4       3                           Allen, Mr. William Henry    male

In [12]:
# Using Regular Expression

# columns which has letter 'a' or 'A' in its name.
df.filter(regex='[aA]').head()

,PassengerId,Pclass,Name,Age,Parch,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",22.0,0,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,0,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",26.0,0,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,0,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",35.0,0,8.0500,NaN,S

In [14]:
# Filter rows of Dataframe based on a Single Value of Column

df[df['Embarked'] == 'S'].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

In [16]:
# Filter rows of Dataframe based on a Single Value of Column using boolean Expression

df[df.Embarked.eq('S')].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

In [17]:
# filter rows for year does not equal to Some value 

df[df['Embarked'] !='S'].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C

In [18]:
# filter rows for year does not equal to Some value 
df[df.Embarked !='S'].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C

In [20]:
# filter out rows ina . dataframe with column year values NA/NAN

df[df.Cabin.notnull()].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

In [22]:
#To select rows whose column value is in list

print(df.Embarked.unique())

df[df.Embarked.isin(['S','Q'])].head()

['S' 'C' 'Q' nan]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [24]:
# Between

df[df['Age'].between(30,50)].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S

In [25]:
# Negation(~)

# Filter rows based on the condistion Embarked is not 'S'

df[~(df.Embarked=='S')].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C

In [26]:
# Filter with multiple Condidtion wher Embarked is not 'S' and Sex is not 'Male'

df[~(df.Embarked =='S') & ~(df.Sex =='male')].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q

In [28]:
# Filter and look only for Specific Column
df[df.Embarked =='S']['PassengerId'].head()

0    1
2    3
3    4
4    5
6    7
Name: PassengerId, dtype: int64

In [30]:
# String Methods (str accessor)

df[df.Sex.str.contains('female')].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [ ]:
# str accessor

# Select rows having values starting from letter 'A'
# df[df['var1'].str[0] == 'A']

# Filter rows having string length greater than 3
# df[df['var1'].str.len()>3]

# Select string containing letters A or B
# df[df['var1'].str.contains('A|B')]

# Str accessor
# df[df.name.str.startswith('J')]

In [32]:
df[(df.Embarked =='S') & (df.Sex == 'male')].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S

In [ ]:
# Filter dataframe based on .loc and .iloc Index methods

In [ ]:
# Select rows whose column value does not equal a specific value
# df.loc[(df.origin != "JFK") & (df.carrier == "B6")]

# Filter pandas dataframe by rows position and column names
# df.loc[df.index[0:5],["origin","dest"]]

# columns which has letter 'a' or 'A' in its name.
# df.filter(regex='[aA]').head()

# Filter rows of Dataframe based on a Single Value of Column
# df[df['Embarked'] == 'S']

# Filter rows of Dataframe based on a Single Value of Column using boolean Expression
# df[df.Embarked.eq('S')]

# filter rows for year does not equal to Some value 
# df[df['Embarked'] !='S']

# filter rows for year does not equal to Some value 
# df[df.Embarked !='S']

# filter out rows ina . dataframe with column year values NA/NAN
# df[df.Cabin.notnull()]

# Selecting multiple values of a column
# Long Way
# newdf = df.loc[(df.origin == "JFK") | (df.origin == "LGA")]

# Smart Way
# newdf = df[df.origin.isin(["JFK", "LGA"])]

In [ ]:
# Filter Based on the row and Column Position

#df.iloc[:]  # Select all the row and Column in the dataframe
#df.iloc[1:5,] #Second to Fifith Row
#df.iloc[5,0] # Sixth row and 1st Column  output : single value (Cell value)
#df.iloc[1:5,0] # Second to Fifth row and First Column
#df.iloc[1:5,:5] # Second to Fifth row, first 5 Columns
#df.iloc[2:7,1:3] # Third to Seventh row,2nd and 3rd Column

# df.iloc[:5,] #First 5 rows
# df.iloc[1:5,] #Second to Fifth row
# df.iloc[5,0] #Sixth row and 1st column
# df.iloc[1:5,0] #Second to Fifth row, first column
# df.iloc[1:5,:5] #Second to Fifth row, first 5 columns
# df.iloc[2:7,1:3] #Third to Seventh row, 2nd and 3rd column

#  df.iloc[[index for index,row in df.iterrows() if row['origin'] == 'JFK' and row['carrier'] == 'B6']]

In [10]:
#isin

value_list = ["S","C"]
df[df.Embarked.isin(value_list)].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
#isin

value_list = ["S","C"]
df[~ df.Embarked.isin(value_list)].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
32,33,1,3,"Glynn, Miss. Mary Agatha",female,NaN,0,0,335677,7.7500,NaN,Q

In [ ]:
# options = ['Commerce', 'Science'] 
# dataframe[dataframe['Stream'].isin(options)] 

# dataframe.loc[(dataframe['Age'] == 22) & dataframe['Stream'].isin(options)]

In [7]:
# query

df.query('Sex == "male" & Embarked == "S"').head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S

In [12]:
import pandas as pd
df=pd.DataFrame({'Name':['JOHN','ALLEN','BOB','NIKI','CHARLIE','CHANG'],
              'Age':[35,42,63,29,47,51],
              'Salary_in_1000':[100,93,78,120,64,115],
             'FT_Team':['STEELERS','SEAHAWKS','FALCONS','FALCONS','PATRIOTS','STEELERS']})
df

      Name  Age  Salary_in_1000   FT_Team
0     JOHN   35             100  STEELERS
1    ALLEN   42              93  SEAHAWKS
2      BOB   63              78   FALCONS
3     NIKI   29             120   FALCONS
4  CHARLIE   47              64  PATRIOTS
5    CHANG   51             115  STEELERS

In [13]:
# Pandas Eval multiple conditions

df[df.eval("Salary_in_1000>=100 & (Age <60) & FT_Team.str.startswith('S').values")]

    Name  Age  Salary_in_1000   FT_Team
0   JOHN   35             100  STEELERS
5  CHANG   51             115  STEELERS

In [17]:
df.loc[np.where((df['Salary_in_1000']>=100) & (df['Age']< 60) & (df['FT_Team'].str.startswith('S')))]

    Name  Age  Salary_in_1000   FT_Team
0   JOHN   35             100  STEELERS
5  CHANG   51             115  STEELERS

In [18]:
df.loc[(df['Salary_in_1000']>=100) & (df['Age']< 60) & (df['FT_Team'].str.startswith('S')),['Name','FT_Team']]

    Name   FT_Team
0   JOHN  STEELERS
5  CHANG  STEELERS

In [20]:
# Select Non-Missing Data in Pandas Dataframe
#df[df.origin.notnull()]

In [ ]:
# Lambda Method for Filtering
# list(filter(lambda x: x["origin"] == 'JFK' and x["carrier"] == 'B6', lst_df))

# List Comprehension Method for Filtering
# list(x for x in lst_df if x["origin"] == 'JFK' and x["carrier"] == 'B6')

In [ ]:
# Lambda Methods

# list(filter(lambda x: x["origin"] == 'JFK' and x["carrier"] == 'B6', lst_df))
# df[df.apply(lambda x: x["origin"] == 'JFK' and x["carrier"] == 'B6', axis=1)]

In [ ]:
# List Comprehension

# l2 = list(x for x in lst_df if x["origin"] == 'JFK' and x["carrier"] == 'B6')
# df.iloc[[index for index,row in df.iterrows() if row['origin'] == 'JFK' and row['carrier'] == 'B6']]